###############################################################################
# Created by write_sdc
###############################################################################
current_design TPU9012
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 8.0000 [get_pins {clk_pad/p2c}]
set_clock_transition 0.2500 [get_clocks {clk}]
set_clock_uncertainty 0.1500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in_PAD[0]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in_PAD[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in_PAD[1]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in_PAD[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in_PAD[2]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in_PAD[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in_PAD[3]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in_PAD[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in_PAD[4]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in_PAD[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in_PAD[5]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in_PAD[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in_PAD[6]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in_PAD[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in_PAD[7]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in_PAD[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {kernel_we_PAD}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -max -add_delay [get_ports {kernel_we_PAD}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {rst_n_PAD}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -max -add_delay [get_ports {rst_n_PAD}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {result_PAD[0]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {result_PAD[1]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {result_PAD[2]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {result_PAD[3]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {result_PAD[4]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {result_PAD[5]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {result_PAD[6]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {result_PAD[7]}]
set_false_path\
    -to [get_ports {alive_PAD}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 2.6000 [get_ports {alive_PAD}]
set_load -pin_load 2.6000 [get_ports {clk_PAD}]
set_load -pin_load 2.6000 [get_ports {kernel_we_PAD}]
set_load -pin_load 2.6000 [get_ports {rst_n_PAD}]
set_load -pin_load 2.6000 [get_ports {data_in_PAD[7]}]
set_load -pin_load 2.6000 [get_ports {data_in_PAD[6]}]
set_load -pin_load 2.6000 [get_ports {data_in_PAD[5]}]
set_load -pin_load 2.6000 [get_ports {data_in_PAD[4]}]
set_load -pin_load 2.6000 [get_ports {data_in_PAD[3]}]
set_load -pin_load 2.6000 [get_ports {data_in_PAD[2]}]
set_load -pin_load 2.6000 [get_ports {data_in_PAD[1]}]
set_load -pin_load 2.6000 [get_ports {data_in_PAD[0]}]
set_load -pin_load 2.6000 [get_ports {result_PAD[7]}]
set_load -pin_load 2.6000 [get_ports {result_PAD[6]}]
set_load -pin_load 2.6000 [get_ports {result_PAD[5]}]
set_load -pin_load 2.6000 [get_ports {result_PAD[4]}]
set_load -pin_load 2.6000 [get_ports {result_PAD[3]}]
set_load -pin_load 2.6000 [get_ports {result_PAD[2]}]
set_load -pin_load 2.6000 [get_ports {result_PAD[1]}]
set_load -pin_load 2.6000 [get_ports {result_PAD[0]}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {kernel_we_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n_PAD}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_PAD[7]}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_PAD[6]}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_PAD[5]}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_PAD[4]}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_PAD[3]}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_PAD[2]}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_PAD[1]}]
set_driving_cell -lib_cell sg13g2_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_PAD[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.5000 [current_design]
set_max_transition 200.0000 [get_ports {alive_PAD}]
set_max_transition 200.0000 [get_ports {clk_PAD}]
set_max_transition 200.0000 [get_ports {kernel_we_PAD}]
set_max_transition 200.0000 [get_ports {rst_n_PAD}]
set_max_transition 200.0000 [get_ports {data_in_PAD[7]}]
set_max_transition 200.0000 [get_ports {data_in_PAD[6]}]
set_max_transition 200.0000 [get_ports {data_in_PAD[5]}]
set_max_transition 200.0000 [get_ports {data_in_PAD[4]}]
set_max_transition 200.0000 [get_ports {data_in_PAD[3]}]
set_max_transition 200.0000 [get_ports {data_in_PAD[2]}]
set_max_transition 200.0000 [get_ports {data_in_PAD[1]}]
set_max_transition 200.0000 [get_ports {data_in_PAD[0]}]
set_max_transition 200.0000 [get_ports {result_PAD[7]}]
set_max_transition 200.0000 [get_ports {result_PAD[6]}]
set_max_transition 200.0000 [get_ports {result_PAD[5]}]
set_max_transition 200.0000 [get_ports {result_PAD[4]}]
set_max_transition 200.0000 [get_ports {result_PAD[3]}]
set_max_transition 200.0000 [get_ports {result_PAD[2]}]
set_max_transition 200.0000 [get_ports {result_PAD[1]}]
set_max_transition 200.0000 [get_ports {result_PAD[0]}]
set_max_capacitance 0.5000 [current_design]
set_max_capacitance 500.0000 [get_ports {alive_PAD}]
set_max_capacitance 500.0000 [get_ports {clk_PAD}]
set_max_capacitance 500.0000 [get_ports {data_in_PAD[0]}]
set_max_capacitance 500.0000 [get_ports {data_in_PAD[1]}]
set_max_capacitance 500.0000 [get_ports {data_in_PAD[2]}]
set_max_capacitance 500.0000 [get_ports {data_in_PAD[3]}]
set_max_capacitance 500.0000 [get_ports {data_in_PAD[4]}]
set_max_capacitance 500.0000 [get_ports {data_in_PAD[5]}]
set_max_capacitance 500.0000 [get_ports {data_in_PAD[6]}]
set_max_capacitance 500.0000 [get_ports {data_in_PAD[7]}]
set_max_capacitance 500.0000 [get_ports {kernel_we_PAD}]
set_max_capacitance 500.0000 [get_ports {result_PAD[0]}]
set_max_capacitance 500.0000 [get_ports {result_PAD[1]}]
set_max_capacitance 500.0000 [get_ports {result_PAD[2]}]
set_max_capacitance 500.0000 [get_ports {result_PAD[3]}]
set_max_capacitance 500.0000 [get_ports {result_PAD[4]}]
set_max_capacitance 500.0000 [get_ports {result_PAD[5]}]
set_max_capacitance 500.0000 [get_ports {result_PAD[6]}]
set_max_capacitance 500.0000 [get_ports {result_PAD[7]}]
set_max_capacitance 500.0000 [get_ports {rst_n_PAD}]
set_max_fanout 6.0000 [current_design]
